MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_rtc.c
/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 *******************************************************************************
 ** \brief De-Initialize RTC
 **
 ** \param [in] None
 **
 ** \retval Ok                          Process successfully done
 ** \retval ErrorTimeout                De-Initialize timeout
 **
 ******************************************************************************/
en_result_t RTC_DeInit(void)
{
    uint8_t u8RegSta;
    uint32_t u32Timeout, u32TimeCnt = 0u;
    en_result_t enRet = Ok;

    M4_RTC->CR0_f.RESET = 0u;
    /* Waiting for normal count status or end of RTC software reset */
    u32Timeout = SystemCoreClock >> 8u;
    do
    {
        u8RegSta = (uint8_t)M4_RTC->CR0_f.RESET;
        u32TimeCnt++;
    } while ((u32TimeCnt < u32Timeout) && (u8RegSta == 1u));

    if (1u == u8RegSta)
    {
        enRet = ErrorTimeout;
    }
    else
    {
        /* Initialize all RTC registers */
        M4_RTC->CR0_f.RESET = 1u;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Initialize RTC
 **
 ** \param [in] pstcRtcInit             Pointer to RTC init configuration
 ** \arg See the struct #stc_rtc_init_t
 **
 ** \retval Ok                          Process successfully done
 ** \retval Error                       Parameter error
 **
 ******************************************************************************/
en_result_t RTC_Init(const stc_rtc_init_t *pstcRtcInit)
{
    en_result_t enRet = Ok;

    if (NULL == pstcRtcInit)
    {
        enRet = Error;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_CLK_SOURCE_TYPE(pstcRtcInit->enClkSource));
        DDL_ASSERT(IS_VALID_PERIOD_INT_CONDITION(pstcRtcInit->enPeriodInt));
        DDL_ASSERT(IS_VALID_TIME_FORMAT(pstcRtcInit->enTimeFormat));
        DDL_ASSERT(IS_VALID_COMPEN_WAY(pstcRtcInit->enCompenWay));
        DDL_ASSERT(IS_VALID_COMPEN_VALUE_RANGE(pstcRtcInit->u16CompenVal));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcRtcInit->enCompenEn));

        /* Configure clock */
        if (RtcClkLrc == pstcRtcInit->enClkSource)
        {
            M4_RTC->CR3_f.LRCEN = 1u;
        }
        M4_RTC->CR3_f.RCKSEL = pstcRtcInit->enClkSource;

        /* Configure control register */
        M4_RTC->CR1_f.PRDS = pstcRtcInit->enPeriodInt;
        M4_RTC->CR1_f.AMPM = pstcRtcInit->enTimeFormat;
        M4_RTC->CR1_f.ONEHZSEL = pstcRtcInit->enCompenWay;

        /* Configure clock error compensation register */
        M4_RTC->ERRCRH_f.COMP8 = ((uint32_t)pstcRtcInit->u16CompenVal >> 8u) & 0x01u;
        M4_RTC->ERRCRL = (uint32_t)pstcRtcInit->u16CompenVal & 0x00FFu;
        M4_RTC->ERRCRH_f.COMPEN = pstcRtcInit->enCompenEn;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Enter RTC read/write mode
 **
 ** \param [in] None
 **
 ** \retval Ok                          Process successfully done
 ** \retval ErrorTimeout                Enter mode timeout
 **
 ******************************************************************************/
en_result_t RTC_EnterRwMode(void)
{
    uint8_t u8RegSta;
    uint32_t u32Timeout, u32TimeCnt = 0u;
    en_result_t enRet = Ok;

    /* Mode switch when RTC is running */
    if (0u != M4_RTC->CR1_f.START)
    {
        M4_RTC->CR2_f.WAIT = 1u;
        /* Waiting for WAITF bit set */
        u32Timeout = SystemCoreClock >> 8u;
        do
        {
            u8RegSta = (uint8_t)M4_RTC->CR2_f.WAITF;
            u32TimeCnt++;
        } while ((u32TimeCnt < u32Timeout) && (u8RegSta == 0u));

        if (0u == u8RegSta)
        {
            enRet = ErrorTimeout;
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Exit RTC read/write mode
 **
 ** \param [in] None
 **
 ** \retval Ok                          Process successfully done
 ** \retval ErrorTimeout                Exit mode timeout
 **
 ******************************************************************************/
en_result_t RTC_ExitRwMode(void)
{
    uint8_t u8RegSta;
    uint32_t u32Timeout, u32TimeCnt = 0u;
    en_result_t enRet = Ok;

    /* Mode switch when RTC is running */
    if (0u != M4_RTC->CR1_f.START)
    {
        M4_RTC->CR2_f.WAIT = 0u;
        /* Waiting for WAITF bit reset */
        u32Timeout = SystemCoreClock >> 8u;
        do
        {
            u8RegSta = (uint8_t)M4_RTC->CR2_f.WAITF;
            u32TimeCnt++;
        } while ((u32TimeCnt < u32Timeout) && (u8RegSta == 1u));

        if (1u == u8RegSta)
        {
            enRet = ErrorTimeout;
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Enable or disable RTC count
 **
 ** \param [in] enNewSta                The function new state
 ** \arg Disable                        Disable RTC count
 ** \arg Enable                         Enable RTC count
 **
 ** \retval Ok                          Process successfully done
 **
 ******************************************************************************/
en_result_t RTC_Cmd(en_functional_state_t enNewSta)
{
    en_result_t enRet = Ok;

    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    M4_RTC->CR1_f.START = enNewSta;

    return enRet;
}

/**
 *******************************************************************************
 ** \brief RTC period interrupt config
 **
 ** \param [in] enIntType               Period interrupt request type
 ** \arg RtcPeriodIntInvalid            Period interrupt invalid
 ** \arg RtcPeriodIntHalfSec            0.5 second period interrupt
 ** \arg RtcPeriodIntOneSec             1 second period interrupt
 ** \arg RtcPeriodIntOneMin             1 minute period interrupt
 ** \arg RtcPeriodIntOneHour            1 hour period interrupt
 ** \arg RtcPeriodIntOneDay             1 day period interrupt
 ** \arg RtcPeriodIntOneMon             1 month period interrupt
 **
 ** \retval Ok                          Process successfully done
 **
 ******************************************************************************/
en_result_t RTC_PeriodIntConfig(en_rtc_period_int_type_t enIntType)
{
    uint8_t u8RtcSta;
    uint8_t u8IntSta;
    en_result_t enRet = Ok;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_PERIOD_INT_CONDITION(enIntType));

    u8RtcSta = (uint8_t)M4_RTC->CR1_f.START;
    u8IntSta = (uint8_t)M4_RTC->CR2_f.PRDIE;
    /* Disable period interrupt when START=1 and PRDIE=1 */
    if ((1u == u8IntSta) && (1u == u8RtcSta))
    {
        M4_RTC->CR2_f.PRDIE = 0u;
    }
    M4_RTC->CR1_f.PRDS = enIntType;

