MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_rtc.c
    if ((1u == u8IntSta) && (1u == u8RtcSta))
    {
        M4_RTC->CR2_f.PRDIE = 1u;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief RTC switch to low power mode
 **
 ** \param [in] None
 **
 ** \retval Ok                          Process successfully done
 ** \retval ErrorInvalidMode            RTC count not start
 ** \retval ErrorTimeout                Switch timeout
 **
 ******************************************************************************/
en_result_t RTC_LowPowerSwitch(void)
{
    uint8_t u8RegSta;
    uint32_t u32Timeout, u32TimeCnt = 0u;
    en_result_t enRet = ErrorInvalidMode;

    /* Check RTC work status */
    if (0u != M4_RTC->CR1_f.START)
    {
        M4_RTC->CR2_f.WAIT = 1u;
        /* Waiting for RTC WAITF bit set */
        u32Timeout = SystemCoreClock / 100u;
        do
        {
            u8RegSta = (uint8_t)M4_RTC->CR2_f.WAITF;
            u32TimeCnt++;
        } while ((u32TimeCnt < u32Timeout) && (u8RegSta == 0u));

        if (0u == u8RegSta)
        {
            enRet = ErrorTimeout;
        }
        else
        {
            M4_RTC->CR2_f.WAIT = 0u;
            /* Waiting for RTC WAITF bit reset */
            u32TimeCnt = 0u;
            do
            {
                u8RegSta = (uint8_t)M4_RTC->CR2_f.WAITF;
                u32TimeCnt++;
            } while ((u32TimeCnt < u32Timeout) && (u8RegSta == 1u));

            if (1u == u8RegSta)
            {
                enRet = ErrorTimeout;
            }
            else
            {
                enRet = Ok;
            }
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set RTC 1hz output compensation value
 **
 ** \param [in] u16CompenVal            Clock compensation value
 ** \arg 0~0x1FF
 **
 ** \retval Ok                          Process successfully done
 **
 ******************************************************************************/
en_result_t RTC_SetClkCompenValue(uint16_t u16CompenVal)
{
    en_result_t enRet = Ok;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_COMPEN_VALUE_RANGE(u16CompenVal));

    M4_RTC->ERRCRH_f.COMP8 = ((uint32_t)u16CompenVal >> 8u) & 0x01u;
    M4_RTC->ERRCRL = (uint32_t)u16CompenVal & 0x00FFu;

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Enable or disable clock compensation
 **
 ** \param [in] enNewSta                The function new state
 ** \arg Disable                        Disable RTC clock compensation
 ** \arg Enable                         Enable RTC clock compensation
 **
 ** \retval Ok                          Process successfully done
 **
 ******************************************************************************/
en_result_t RTC_ClkCompenCmd(en_functional_state_t enNewSta)
{
    en_result_t enRet = Ok;

    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    M4_RTC->ERRCRH_f.COMPEN = enNewSta;

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Enable or disable RTC 1hz output
 **
 ** \param [in] enNewSta                The function new state
 ** \arg Disable                        Disable RTC 1hz output
 ** \arg Enable                         Enable RTC 1hz output
 **
 ** \retval Ok                          Process successfully done
 **
 ******************************************************************************/
en_result_t RTC_OneHzOutputCmd(en_functional_state_t enNewSta)
{
    en_result_t enRet = Ok;

    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    M4_RTC->CR1_f.ONEHZOE = enNewSta;

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set RTC current date and time
 **
 ** \param [in] enFormat                Date and time data format
 ** \arg RtcDataFormatDec               Decimal format
 ** \arg RtcDataFormatBcd               BCD format
 **
 ** \param [in] pstcRtcDateTime         Pointer to RTC date and time configuration
 ** \arg See the struct #stc_rtc_date_time_t
 **
 ** \param [in] enUpdateDateEn          The function new state(Contain year/month/day/weekday)
 ** \arg Disable                        Disable update RTC date
 ** \arg Enable                         Enable update RTC date
 **
 ** \param [in] enUpdateTimeEn          The function new state(Contain hour/minute/second)
 ** \arg Disable                        Disable update RTC time
 ** \arg Enable                         Enable update RTC time
 **
 ** \retval Ok                          Process successfully done
 ** \retval Error                       Enter or exit read/write mode failed
 ** \retval ErrorInvalidParameter       Parameter enUpdateDateEn or enUpdateTimeEn invalid
 **
 ******************************************************************************/
en_result_t RTC_SetDateTime(en_rtc_data_format_t enFormat, const stc_rtc_date_time_t *pstcRtcDateTime,
                            en_functional_state_t enUpdateDateEn, en_functional_state_t enUpdateTimeEn)
{
    en_result_t enRet = Ok;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_DATA_FORMAT(enFormat));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enUpdateDateEn));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enUpdateTimeEn));

    /* Check update status */
    if (((Disable == enUpdateDateEn) && (Disable == enUpdateTimeEn)) || (NULL == pstcRtcDateTime))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check the date parameters */
        if (Enable == enUpdateDateEn)
        {
            if (RtcDataFormatDec == enFormat)
            {
                DDL_ASSERT(IS_VALID_DATE_YEAR(pstcRtcDateTime->u8Year));
                DDL_ASSERT(IS_VALID_DATE_MONTH(pstcRtcDateTime->u8Month));
                DDL_ASSERT(IS_VALID_DATE_DAY(pstcRtcDateTime->u8Day));
            }
            else
            {
                DDL_ASSERT(IS_VALID_DATE_YEAR(BCD2DEC(pstcRtcDateTime->u8Year)));
                DDL_ASSERT(IS_VALID_DATE_MONTH(BCD2DEC(pstcRtcDateTime->u8Month)));
                DDL_ASSERT(IS_VALID_DATE_DAY(BCD2DEC(pstcRtcDateTime->u8Day)));
            }
            DDL_ASSERT(IS_VALID_DATE_WEEKDAY(pstcRtcDateTime->u8Weekday));
        }
        /* Check the time parameters */
        if (Enable == enUpdateTimeEn)
        {
            if (RtcDataFormatDec == enFormat)
            {
                if (RtcTimeFormat12Hour == M4_RTC->CR1_f.AMPM)
                {
                    DDL_ASSERT(IS_VALID_TIME_HOUR12(pstcRtcDateTime->u8Hour));
                    DDL_ASSERT(IS_VALID_HOUR12_AMPM(pstcRtcDateTime->enAmPm));
                }
                else
                {
                    DDL_ASSERT(IS_VALID_TIME_HOUR24(pstcRtcDateTime->u8Hour));
                }
                DDL_ASSERT(IS_VALID_TIME_MINUTE(pstcRtcDateTime->u8Minute));
                DDL_ASSERT(IS_VALID_TIME_SECOND(pstcRtcDateTime->u8Second));
            }
            else
            {
                if (RtcTimeFormat12Hour == M4_RTC->CR1_f.AMPM)
                {
                    DDL_ASSERT(IS_VALID_TIME_HOUR12(BCD2DEC(pstcRtcDateTime->u8Hour)));
                    DDL_ASSERT(IS_VALID_HOUR12_AMPM(pstcRtcDateTime->enAmPm));
                }
                else
                {
                    DDL_ASSERT(IS_VALID_TIME_HOUR24(BCD2DEC(pstcRtcDateTime->u8Hour)));
                }
                DDL_ASSERT(IS_VALID_TIME_MINUTE(BCD2DEC(pstcRtcDateTime->u8Minute)));
                DDL_ASSERT(IS_VALID_TIME_SECOND(BCD2DEC(pstcRtcDateTime->u8Second)));
            }
        }

