MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_rtc.c
        /* Enter read/write mode */
        if (RTC_EnterRwMode() == ErrorTimeout)
        {
            enRet = Error;
        }
        else
        {
            /* Update date */
            if (Enable == enUpdateDateEn)
            {
                if (RtcDataFormatDec == enFormat)
                {
                    M4_RTC->YEAR = DEC2BCD((uint32_t)pstcRtcDateTime->u8Year);
                    M4_RTC->MON = DEC2BCD((uint32_t)pstcRtcDateTime->u8Month);
                    M4_RTC->DAY = DEC2BCD((uint32_t)pstcRtcDateTime->u8Day);
                }
                else
                {
                    M4_RTC->YEAR = pstcRtcDateTime->u8Year;
                    M4_RTC->MON = pstcRtcDateTime->u8Month;
                    M4_RTC->DAY = pstcRtcDateTime->u8Day;
                }
                M4_RTC->WEEK = pstcRtcDateTime->u8Weekday;
            }
            /* Update time */
            if (Enable == enUpdateTimeEn)
            {
                if (RtcDataFormatDec == enFormat)
                {
                    if ((RtcTimeFormat12Hour == M4_RTC->CR1_f.AMPM) &&
                        (RtcHour12Pm == pstcRtcDateTime->enAmPm))
                    {
                        M4_RTC->HOUR = DEC2BCD((uint32_t)pstcRtcDateTime->u8Hour) | RTC_HOUR12_AMPM_MASK;
                    }
                    else
                    {
                        M4_RTC->HOUR = DEC2BCD((uint32_t)pstcRtcDateTime->u8Hour);
                    }
                    M4_RTC->MIN = DEC2BCD((uint32_t)pstcRtcDateTime->u8Minute);
                    M4_RTC->SEC = DEC2BCD((uint32_t)pstcRtcDateTime->u8Second);
                }
                else
                {
                    if ((RtcTimeFormat12Hour == M4_RTC->CR1_f.AMPM) &&
                        (RtcHour12Pm == pstcRtcDateTime->enAmPm))
                    {
                        M4_RTC->HOUR = (uint32_t)pstcRtcDateTime->u8Hour | RTC_HOUR12_AMPM_MASK;
                    }
                    else
                    {
                        M4_RTC->HOUR = (uint32_t)pstcRtcDateTime->u8Hour;
                    }
                    M4_RTC->MIN = pstcRtcDateTime->u8Minute;
                    M4_RTC->SEC = pstcRtcDateTime->u8Second;
                }
            }
            /* Exit read/write mode */
            if (RTC_ExitRwMode() == ErrorTimeout)
            {
                enRet = Error;
            }
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Get RTC current date and time
 **
 ** \param [in] enFormat                Date and time data format
 ** \arg RtcDataFormatDec               Decimal format
 ** \arg RtcDataFormatBcd               BCD format
 **
 ** \param [out] pstcRtcDateTime        Pointer to RTC date and time configuration
 ** \arg See the struct #stc_rtc_date_time_t
 **
 ** \retval Ok                          Process successfully done
 ** \retval Error                       Enter or exit read/write mode failed
 **
 ******************************************************************************/
en_result_t RTC_GetDateTime(en_rtc_data_format_t enFormat, stc_rtc_date_time_t *pstcRtcDateTime)
{
    en_result_t enRet = Ok;

    if (NULL == pstcRtcDateTime)
    {
        enRet = Error;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_DATA_FORMAT(enFormat));

        /* Enter read/write mode */
        if (RTC_EnterRwMode() == ErrorTimeout)
        {
            enRet = Error;
        }
        else
        {
            /* Get RTC date and time registers */
            pstcRtcDateTime->u8Year = (uint8_t)(M4_RTC->YEAR);
            pstcRtcDateTime->u8Month = (uint8_t)(M4_RTC->MON);
            pstcRtcDateTime->u8Day = (uint8_t)(M4_RTC->DAY);
            pstcRtcDateTime->u8Weekday = (uint8_t)(M4_RTC->WEEK);
            pstcRtcDateTime->u8Hour = (uint8_t)(M4_RTC->HOUR);
            pstcRtcDateTime->u8Minute = (uint8_t)(M4_RTC->MIN);
            pstcRtcDateTime->u8Second = (uint8_t)(M4_RTC->SEC);
            if (RtcTimeFormat12Hour == M4_RTC->CR1_f.AMPM)
            {
                if (RTC_HOUR12_AMPM_MASK == (pstcRtcDateTime->u8Hour & RTC_HOUR12_AMPM_MASK))
                {
                    pstcRtcDateTime->u8Hour &= (uint8_t)(~RTC_HOUR12_AMPM_MASK);
                    pstcRtcDateTime->enAmPm = RtcHour12Pm;
                }
                else
                {
                    pstcRtcDateTime->enAmPm = RtcHour12Am;
                }
            }

            /* Check decimal format*/
            if (RtcDataFormatDec == enFormat)
            {
                pstcRtcDateTime->u8Year = BCD2DEC(pstcRtcDateTime->u8Year);
                pstcRtcDateTime->u8Month = BCD2DEC(pstcRtcDateTime->u8Month);
                pstcRtcDateTime->u8Day = BCD2DEC(pstcRtcDateTime->u8Day);
                pstcRtcDateTime->u8Hour = BCD2DEC(pstcRtcDateTime->u8Hour);
                pstcRtcDateTime->u8Minute = BCD2DEC(pstcRtcDateTime->u8Minute);
                pstcRtcDateTime->u8Second = BCD2DEC(pstcRtcDateTime->u8Second);
            }

            /* exit read/write mode */
            if (RTC_ExitRwMode() == ErrorTimeout)
            {
                enRet = Error;
            }
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set RTC alarm time
 **
 ** \param [in] enFormat                Date and time data format
 ** \arg RtcDataFormatDec               Decimal format
 ** \arg RtcDataFormatBcd               BCD format
 **
 ** \param [in] pstcRtcAlarmTime        Pointer to RTC alarm time configuration
 ** \arg See the struct #stc_rtc_alarm_time_t
 **
 ** \retval Ok                          Process successfully done
 ** \retval Error                       Parameter error
 **
 ******************************************************************************/
en_result_t RTC_SetAlarmTime(en_rtc_data_format_t enFormat, const stc_rtc_alarm_time_t *pstcRtcAlarmTime)
{
    en_result_t enRet = Ok;

    if (NULL == pstcRtcAlarmTime)
    {
        enRet = Error;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_DATA_FORMAT(enFormat));

        if (RtcDataFormatDec == enFormat)
        {
            if (RtcTimeFormat12Hour == M4_RTC->CR1_f.AMPM)
            {
                DDL_ASSERT(IS_VALID_TIME_HOUR12(pstcRtcAlarmTime->u8Hour));
                DDL_ASSERT(IS_VALID_HOUR12_AMPM(pstcRtcAlarmTime->enAmPm));
            }
            else
            {
                DDL_ASSERT(IS_VALID_TIME_HOUR24(pstcRtcAlarmTime->u8Hour));
            }
            DDL_ASSERT(IS_VALID_TIME_MINUTE(pstcRtcAlarmTime->u8Minute));
        }
        else
        {
            if (RtcTimeFormat12Hour == M4_RTC->CR1_f.AMPM)
            {
                DDL_ASSERT(IS_VALID_TIME_HOUR12(BCD2DEC(pstcRtcAlarmTime->u8Hour)));
                DDL_ASSERT(IS_VALID_HOUR12_AMPM(pstcRtcAlarmTime->enAmPm));
            }
            else
            {
                DDL_ASSERT(IS_VALID_TIME_HOUR24(BCD2DEC(pstcRtcAlarmTime->u8Hour)));
            }
            DDL_ASSERT(IS_VALID_TIME_MINUTE(BCD2DEC(pstcRtcAlarmTime->u8Minute)));
        }
        DDL_ASSERT(IS_VALID_ALARM_WEEKDAY(pstcRtcAlarmTime->u8Weekday));

